In [4]:
import pandas as pd
import numpy as np

In [5]:
input_col = ['1 year', '5 yr', '9', '7 years', '9 yrs']

In [6]:
x = pd.DataFrame(input_col)
x

         0
0   1 year
1     5 yr
2        9
3  7 years
4    9 yrs

In [7]:
output_col = []

for i in input_col:
    print(i[0] +' ' + 'year')

1 year
5 year
9 year
7 year
9 year

In [8]:
x1 = x[0].str.slice(0,1) + ' year'
x1

0    1 year
1    5 year
2    9 year
3    7 year
4    9 year
Name: 0, dtype: object

In [9]:
df = pd.DataFrame({'Age': ['1 year', '5 yr', '9', '7 years', '9 yrs']})

In [10]:
df

       Age
0   1 year
1     5 yr
2        9
3  7 years
4    9 yrs

In [11]:
# Direct Approach
df['New Age'] = df.Age.str.slice(0,1) + ' Year'

In [12]:
df

       Age New Age
0   1 year  1 Year
1     5 yr  5 Year
2        9  9 Year
3  7 years  7 Year
4    9 yrs  9 Year

In [13]:
# Indirect Approach
temp_list = df.Age.str.slice(0,1).to_list()

# Just check the output
for i in temp_list:
    print(i + ' Year')
    
df['New Age'] = [i + ' Year' for i in temp_list]
df

1 Year
5 Year
9 Year
7 Year
9 Year

       Age New Age
0   1 year  1 Year
1     5 yr  5 Year
2        9  9 Year
3  7 years  7 Year
4    9 yrs  9 Year

In [14]:
temp_list

['1', '5', '9', '7', '9']

In [39]:
df = pd.DataFrame({'c_code':['101AP001','102CE002','103NA003']})
df

     c_code
0  101AP001
1  102CE002
2  103NA003

In [40]:
z = df.c_code.str.slice(3,5)
z

0    AP
1    CE
2    NA
Name: c_code, dtype: object

In [43]:
r = []
for i in z:
    if i == 'NA':
        r.append('North America')
    if i == 'CE':
        r.append('country europe')
    elif i == 'AP':
        r.append('Asia pacific')


# df.drop(columns=['x'],axis=1)

In [44]:
df['Country'] = r
df

     c_code         Country
0  101AP001    Asia pacific
1  102CE002  country europe
2  103NA003   North America